-- dialect=mysql
create table clazz(
    id   int unsigned primary key auto_increment comment 'ID,主键',
    name  varchar(30) not null unique  comment '班级名称',
    room  varchar(20) comment '班级教室',
    begin_date date not null comment '开课时间',
    end_date date not null comment '结课时间',
    master_id int unsigned null comment '班主任ID, 关联员工表ID',
    subject tinyint unsigned not null comment '学科, 1:java, 2:前端, 3:大数据, 4:Python, 5:Go, 6: 嵌入式',
    create_time datetime  comment '创建时间',
    update_time datetime  comment '修改时间'
)comment '班级表';

INSERT INTO clazz VALUES (1,'JavaEE就业163期','212','2023-04-30','2023-06-29',10,1,'2023-06-01 17:08:23','2023-06-01 17:39:58'),
	(4,'前端就业90期','210','2023-07-10','2024-01-20',3,2,'2023-06-01 17:45:12','2023-06-01 17:45:12'),
	(5,'JavaEE就业165期','108','2023-06-15','2023-12-25',6,1,'2023-06-01 17:45:40','2023-06-01 17:45:40'),
	(6,'JavaEE就业166期','105','2023-07-20','2024-02-20',20,1,'2023-06-01 17:46:10','2023-06-01 17:46:10'),
	(7,'大数据就业58期','209','2023-08-01','2024-02-15',7,3,'2023-06-01 17:51:21','2023-06-01 17:51:21'),
	(8,'JavaEE就业167期','325','2023-11-20','2024-05-10',36,1,'2023-11-15 11:35:46','2023-12-13 14:31:24');
	
	

create table student(
  id int unsigned primary key auto_increment comment 'ID,主键',
  name varchar(10)  not null comment '姓名',
  no char(10)  not null unique comment '学号',
  gender tinyint unsigned  not null comment '性别, 1: 男, 2: 女',
  phone  varchar(11)  not null unique comment '手机号',
  id_card  char(18)  not null unique comment '身份证号',
  is_college tinyint unsigned  not null comment '是否来自于院校, 1:是, 0:否',
  address  varchar(100)  comment '联系地址',
  degree  tinyint unsigned  comment '最高学历, 1:初中, 2:高中, 3:大专, 4:本科, 5:硕士, 6:博士',
  graduation_date date comment '毕业时间',
  clazz_id  int unsigned not null comment '班级ID, 关联班级表ID',
  violation_count tinyint unsigned default '0' not null comment '违纪次数',
  violation_score tinyint unsigned default '0' not null comment '违纪扣分',
  create_time  datetime  comment '创建时间',
  update_time  datetime  comment '修改时间'
) comment '学员表';


INSERT INTO student VALUES (1,'段誉','2022000001',1,'18800000001','110120000300200001',1,'北京市昌平区建材城西路1号',1,'2021-07-01',2,0,0,'2023-11-14 21:22:19','2023-11-15 16:20:59'),
	(2,'萧峰','2022000002',1,'18800210003','110120000300200002',1,'北京市昌平区建材城西路2号',2,'2022-07-01',1,0,0,'2023-11-14 21:22:19','2023-11-14 21:22:19'),
	(3,'虚竹','2022000003',1,'18800013001','110120000300200003',1,'北京市昌平区建材城西路3号',2,'2023-07-01',1,0,0,'2023-11-14 21:22:19','2023-11-14 21:22:19'),
	(4,'萧远山','2022000004',1,'18800003211','110120000300200004',1,'北京市昌平区建材城西路4号',3,'2024-07-01',1,0,0,'2023-11-14 21:22:19','2023-11-14 21:22:19'),
	(5,'阿朱','2022000005',2,'18800160002','110120000300200005',1,'北京市昌平区建材城西路5号',4,'2020-07-01',1,0,0,'2023-11-14 21:22:19','2023-11-14 21:22:19'),
	(6,'阿紫','2022000006',2,'18800000034','110120000300200006',1,'北京市昌平区建材城西路6号',4,'2021-07-01',2,0,0,'2023-11-14 21:22:19','2023-11-14 21:22:19'),
	(7,'游坦之','2022000007',1,'18800000067','110120000300200007',1,'北京市昌平区建材城西路7号',4,'2022-07-01',2,0,0,'2023-11-14 21:22:19','2023-11-14 21:22:19'),
	(8,'康敏','2022000008',2,'18800000077','110120000300200008',1,'北京市昌平区建材城西路8号',5,'2023-07-01',2,0,0,'2023-11-14 21:22:19','2023-11-14 21:22:19'),
	(9,'徐长老','2022000009',1,'18800000341','110120000300200009',1,'北京市昌平区建材城西路9号',3,'2024-07-01',2,0,0,'2023-11-14 21:22:19','2023-11-14 21:22:19'),
	(10,'云中鹤','2022000010',1,'18800006571','110120000300200010',1,'北京市昌平区建材城西路10号',2,'2020-07-01',2,0,0,'2023-11-14 21:22:19','2023-11-14 21:22:19'),
	(11,'钟万仇','2022000011',1,'18800000391','110120000300200011',1,'北京市昌平区建材城西路11号',4,'2021-07-01',1,0,0,'2023-11-14 21:22:19','2023-11-15 16:21:24'),
	(12,'崔百泉','2022000012',1,'18800000781','110120000300200018',1,'北京市昌平区建材城西路12号',4,'2022-07-05',8,6,17,'2023-11-14 21:22:19','2023-12-13 14:33:58'),
	(13,'耶律洪基','2022000013',1,'18800008901','110120000300200013',1,'北京市昌平区建材城西路13号',4,'2023-07-01',2,0,0,'2023-11-14 21:22:19','2023-11-15 16:21:21'),
	(14,'天山童姥','2022000014',2,'18800009201','110120000300200014',1,'北京市昌平区建材城西路14号',4,'2024-07-01',1,0,0,'2023-11-14 21:22:19','2023-11-15 16:21:17'),
	(15,'刘竹庄','2022000015',1,'18800009401','110120000300200015',1,'北京市昌平区建材城西路15号',3,'2020-07-01',4,0,0,'2023-11-14 21:22:19','2023-11-14 21:22:19'),
	(16,'李春来','2022000016',1,'18800008501','110120000300200016',1,'北京市昌平区建材城西路16号',4,'2021-07-01',4,0,0,'2023-11-14 21:22:19','2023-11-14 21:22:19'),
	(17,'王语嫣','2022000017',2,'18800007601','110120000300200017',1,'北京市昌平区建材城西路17号',2,'2022-07-01',4,0,0,'2023-11-14 21:22:19','2023-11-14 21:22:19'),
	(18,'郑成功','2023001101',1,'13309092345','110110110110110110',0,'北京市昌平区回龙观街道88号',5,'2021-07-01',8,2,7,'2023-11-15 16:26:18','2023-11-15 16:40:10');
